app/controllers/barter_board_categories_controller.rb

SELECT * FROM `barter_board_categories`
---
  def index
    @barter_board_categories = BarterBoardCategory.all

SELECT * FROM `barter_board_categories` WHERE (`barter_board_categories`.`id` = 2053932785)
---
  def show
    @barter_board_category = BarterBoardCategory.find(params[:id])

SELECT * FROM `barter_board_categories` WHERE (`barter_board_categories`.`id` = 2053932785)
---
  def edit
    @barter_board_category = BarterBoardCategory.find(params[:id])

INSERT INTO "barter_board_categories" ("name", "created_at", "updated_at", "description") VALUES('Cat1', '2010-01-30 07:00:30', '2010-01-30 07:00:30', NULL)
---
  def create
    @barter_board_category = BarterBoardCategory.new(params[:barter_board_category])

    respond_to do |format|
      if @barter_board_category.save

SELECT * FROM `barter_board_categories` WHERE (`barter_board_categories`.`id` = 2053932785)
---
  def update
    @barter_board_category = BarterBoardCategory.find(params[:id])

SELECT * FROM `barter_board_categories` WHERE (`barter_board_categories`.`id` = 2053932785)
DELETE FROM `barter_board_categories` WHERE `id` = 2053932785
---
  def destroy
    @barter_board_category = BarterBoardCategory.find(params[:id])
    @barter_board_category.destroy