app/controllers/barter_board_entries_controller.rb

  def index
    @barter_board_entries = BarterBoardEntry.all
    @barter_board_entries_hash = Hash.new
    BarterBoardCategory.all.each do |cat|
      case params[:sort_by]
      when "offered"
        @barter_board_entries_hash[cat] = BarterBoardEntry.find_all_by_offered_category_id(cat.id)
---
SELECT * FROM `barter_board_entries`
SELECT * FROM `barter_board_categories`
SELECT * FROM `barter_board_entries` WHERE (`barter_board_entries`.`offered_category_id` = 298486374)

  def show
    @barter_board_entry = BarterBoardEntry.find(params[:id])
---
SELECT * FROM `barter_board_entries` WHERE (`barter_board_entries`.`id` = 2053932785)

  def new
    @barter_board_entry = BarterBoardEntry.new
    @barter_board_categories = BarterBoardCategory.all
---
SELECT * FROM `barter_board_categories`

  def edit
    @barter_board_entry = BarterBoardEntry.find(params[:id])
    @barter_board_categories = BarterBoardCategory.all
---
SELECT * FROM `barter_board_entries` WHERE (`barter_board_entries`.`id` = 2053932785)
SELECT * FROM `barter_board_categories`

  def create
    @barter_board_entry = BarterBoardEntry.new(params[:barter_board_entry].merge({:member_id => current_member.id}))

    respond_to do |format|
      if @barter_board_entry.save
---
INSERT INTO `barter_board_entries` (`barter_board_category_id`, `brief_description`, `details`, `contact_info`, `member_id`, `created_at`, `updated_at`) VALUES(1, 'Really Tastey Tomatoes', 'These are great tomatoes! I just have way too many. Will either take $ or trade for some work in my garden. I need to get a bunch of space tilled. Any takers?', 'Dave - 345-6784', 13, '2009-10-05 07:16:51', '2009-10-05 07:16:51')

  def update
    @barter_board_entry = BarterBoardEntry.find(params[:id])
---
SELECT * FROM `barter_board_entries` WHERE (`barter_board_entries`.`id` = 2053932785)

  def destroy
    @barter_board_entry = BarterBoardEntry.find(params[:id])
    @barter_board_entry.destroy
---
SELECT * FROM `barter_board_entries` WHERE (`barter_board_entries`.`id` = 2053932785)
DELETE FROM `barter_board_entries` WHERE `id` = 2053932785