app/controllers/board_members_controller.rb

	def index
		@board_members = BoardMember.all
---
SELECT * FROM `board_members`

	def show
		@board_member = BoardMember.find(params[:id])
---
SELECT * FROM `board_members` WHERE (`board_members`.`id` = 2053932785)

	def edit
		@board_member = BoardMember.find(params[:id])
---
SELECT * FROM `board_members` WHERE (`board_members`.`id` = 2053932785)

	def create
		@board_member = BoardMember.new(params[:board_member])

		respond_to do |format|
			if @board_member.save
---
INSERT INTO `board_members` (`name`, `role`, `description`, `image_url`, `active`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, NULL, NULL, '2009-10-26 20:36:24', '2009-10-26 20:36:24')

	def update
		@board_member = BoardMember.find(params[:id])
---
SELECT * FROM `board_members` WHERE (`board_members`.`id` = 2053932785)

	def destroy
		@board_member = BoardMember.find(params[:id])
		@board_member.destroy
---
SELECT * FROM `board_members` WHERE (`board_members`.`id` = 2053932785)
DELETE FROM `board_members` WHERE `id` = 2053932785