app/controllers/comments_controller.rb

	def index
		@comments = Comment.all
---
SELECT * FROM `comments`

	def show
		@comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2053932785)

	def edit
		@comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2053932785)

	def create
		@comment = Comment.new(params[:comment])

		respond_to do |format|
			if @comment.save
---
INSERT INTO `comments` (`commentable_type`, `commentable_id`, `body`, `member_id`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, NULL, '2009-10-26 20:36:24', '2009-10-26 20:36:24')

	def update
		@comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2053932785)

	def destroy
		@comment = Comment.find(params[:id])
		@comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2053932785)
DELETE FROM `comments` WHERE `id` = 2053932785