app/controllers/content_items_controller.rb

SELECT * FROM `content_items`
---
  def index
    @content_items = ContentItem.all

SELECT * FROM `content_items` WHERE (`content_items`.`id` = 2053932785)
---
  def show
    if params[:id]
      @content_item = ContentItem.find(params[:id])

SELECT * FROM `content_items` WHERE (`content_items`.`id` = 2053932785)
---
  def edit
    @content_item = ContentItem.find(params[:id])

INSERT INTO `content_items` (`tag`, `content`, `created_at`, `updated_at`) VALUES(NULL, NULL, '2009-10-26 20:36:24', '2009-10-26 20:36:24')
---
  def create
    @content_item = ContentItem.new(params[:content_item])

    respond_to do |format|
      if @content_item.save

SELECT * FROM `content_items` WHERE (`content_items`.`id` = 2053932785)
---
  def update
    @content_item = ContentItem.find(params[:id])

SELECT * FROM `content_items` WHERE (`content_items`.`id` = 2053932785)
DELETE FROM `content_items` WHERE `id` = 2053932785
---
  def destroy
    @content_item = ContentItem.find(params[:id])
    @content_item.destroy