app/controllers/distributors_controller.rb

  def index
    @distributors = Distributor.all
---
SELECT * FROM `distributors`

  def show
    @distributor = Distributor.find(params[:id])
---
SELECT * FROM `distributors` WHERE (`distributors`.`id` = 2053932785)

  def edit
    @distributor = Distributor.find(params[:id])
---
SELECT * FROM `distributors` WHERE (`distributors`.`id` = 2053932785)

  def create
    @distributor = Distributor.new(params[:distributor])

    respond_to do |format|
      if @distributor.save
---
INSERT INTO `distributors` (`name`, `address`, `website`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2009-10-26 21:41:23', '2009-10-26 21:41:23')

  def update
    @distributor = Distributor.find(params[:id])
---
SELECT * FROM `distributors` WHERE (`distributors`.`id` = 2053932785)

  def destroy
    @distributor = Distributor.find(params[:id])
    @distributor.destroy
---
SELECT * FROM `distributors` WHERE (`distributors`.`id` = 2053932785)
DELETE FROM `distributors` WHERE `id` = 2053932785