app/controllers/event_categories_controller.rb

  def index
    @event_categories = EventCategory.all
---
SELECT * FROM `event_categories`

  def show
    @event_category = EventCategory.find(params[:id])
---
SELECT * FROM `event_categories` WHERE (`event_categories`.`id` = 2053932785)

  def edit
    @event_category = EventCategory.find(params[:id])
---
SELECT * FROM `event_categories` WHERE (`event_categories`.`id` = 2053932785)

  def create
    @event_category = EventCategory.new(params[:event_category])

    respond_to do |format|
      if @event_category.save
---
INSERT INTO `event_categories` (`name`, `created_at`, `updated_at`) VALUES(NULL, '2009-10-26 20:36:25', '2009-10-26 20:36:25')

  def update
    @event_category = EventCategory.find(params[:id])
---
SELECT * FROM `event_categories` WHERE (`event_categories`.`id` = 2053932785)

  def destroy
    @event_category = EventCategory.find(params[:id])
    @event_category.destroy
---
SELECT * FROM `event_categories` WHERE (`event_categories`.`id` = 2053932785)
DELETE FROM `event_categories` WHERE `id` = 2053932785