app/controllers/faqs_controller.rb

	def index
		@faqs = Faq.all
---
SELECT * FROM `faqs`

	def show
		@faq = Faq.find(params[:id])
---
SELECT * FROM `faqs` WHERE (`faqs`.`id` = 2053932785)

	def edit
		@faq = Faq.find(params[:id])
---
SELECT * FROM `faqs` WHERE (`faqs`.`id` = 2053932785)

	def create
		@faq = Faq.new(params[:faq])

		respond_to do |format|
			if @faq.save
---
INSERT INTO `faqs` (`question`, `answer`, `created_at`, `updated_at`) VALUES(NULL, NULL, '2009-10-26 20:36:25', '2009-10-26 20:36:25')

	def update
		@faq = Faq.find(params[:id])
---
SELECT * FROM `faqs` WHERE (`faqs`.`id` = 2053932785)

	def destroy
		@faq = Faq.find(params[:id])
		@faq.destroy
---
SELECT * FROM `faqs` WHERE (`faqs`.`id` = 2053932785)
DELETE FROM `faqs` WHERE `id` = 2053932785