app/controllers/forum_topics_controller.rb

  def index
    @forum_topics = ForumTopic.all
---
SELECT * FROM `forum_topics`

  def show
    @forum_topic = ForumTopic.find(params[:id])
    @forum_posts = @forum_topic.forum_posts.paginate(:page => params[:page], :per_page => 20)
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 2053932785)
SELECT * FROM "forum_posts" WHERE ("forum_posts".forum_topic_id = 980190962) LIMIT 20 OFFSET 0
SELECT * FROM `forum_topics` ORDER BY forum_topics.id DESC LIMIT 1

  def edit
    @forum_topic = ForumTopic.find(params[:id])
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 2053932785)

  def create
    @forum_topic = ForumTopic.new(params[:forum_topic])

    respond_to do |format|
      if @forum_topic.save
---
INSERT INTO `forum_topics` (`subject`, `forum_category_id`, `created_at`, `updated_at`) VALUES('Awesome Chocolate Chip Cookies', 1, '2009-09-20 22:07:51', '2009-09-20 22:07:51')

  def update
    @forum_topic = ForumTopic.find(params[:id])

    respond_to do |format|
      if @forum_topic.update_attributes(params[:forum_topic])
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 2053932785)
UPDATE `forum_topics` SET `subject` = 'Seriously Awesome Chocolate Chip Cookies', `updated_at` = '2009-09-28 07:26:10' WHERE `id` = 1

  def destroy
    @forum_topic = ForumTopic.find(params[:id])
    @forum_topic.destroy
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 2053932785)
DELETE FROM `forum_topics` WHERE `id` = 2053932785