app/controllers/forum_category_subscriptions_controller.rb

SELECT * FROM "forum_category_subscriptions" LIMIT 20 OFFSET 0
---
	def index
		@forum_category_subscriptions = ForumCategorySubscription.paginate(:page => params[:page], :per_page => FORUM_CATEGORY_SUBSCRIPTIONS_PER_PAGE)

SELECT * FROM `forum_category_subscriptions` WHERE (`forum_category_subscriptions`.`id` = 2053932785)
---
	def find_forum_category_subscription
		@forum_category_subscription = ForumCategorySubscription.find(params[:id]) if params[:id]