app/controllers/forum_posts_controller.rb

  def index
    @forum_posts = ForumPost.all
---
SELECT * FROM `forum_posts`

  def show
    @forum_post = ForumPost.find(params[:id])
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 2053932785)

  def edit
    @forum_post = ForumPost.find(params[:id])
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 2053932785)

  def create
    @forum_post = ForumPost.new(params[:forum_post].merge(:member_id => current_member.id))

    respond_to do |format|
      if @forum_post.save
---
INSERT INTO `forum_posts` (`body`, `forum_topic_id`, `created_at`, `updated_at`) VALUES('Take a bunch of flower and eggs and sugar and stuff and mix it together. Bake at 420 degrees F (hehe) and then eat with friends : )', 1, '2009-09-20 22:20:32', '2009-09-20 22:20:32')

  def update
    @forum_post = ForumPost.find(params[:id])
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 2053932785)

  def destroy
    @forum_post = ForumPost.find(params[:id])
    @forum_post.destroy
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 2053932785)
DELETE FROM `forum_posts` WHERE `id` = 2053932785