app/controllers/forum_categories_controller.rb

SELECT * FROM `forum_categories`
---
  def index
    @forum_categories = ForumCategory.all

SELECT * FROM `forum_categories` WHERE (`forum_categories`.`id` = 2053932785)
SELECT * FROM `forum_posts` WHERE (`forum_posts`.forum_topic_id = 2053932785) ORDER BY forum_posts.id DESC LIMIT 1
SELECT * FROM `forum_topics` WHERE (`forum_topics`.forum_category_id = 2053932785)
---
  def show
    @forum_category = ForumCategory.find(params[:id])
    page_results = @forum_category.forum_topics.sort do |top1, top2|
      top2.forum_posts.last.created_at <=> top1.forum_posts.last.created_at
    end
    @page_results = page_results.paginate(:page => params[:page], :per_page => 20)

SELECT * FROM `forum_categories` WHERE (`forum_categories`.`id` = 2053932785)
---
  def edit
    @forum_category = ForumCategory.find(params[:id])

INSERT INTO `forum_categories` (`name`, `created_at`, `updated_at`) VALUES(NULL, '2009-10-26 20:36:25', '2009-10-26 20:36:25')
---
  def create
    @forum_category = ForumCategory.new(params[:forum_category])

    respond_to do |format|
      if @forum_category.save

SELECT * FROM `forum_categories` WHERE (`forum_categories`.`id` = 2053932785)
---
  def update
    @forum_category = ForumCategory.find(params[:id])

SELECT * FROM `forum_categories` WHERE (`forum_categories`.`id` = 2053932785)
DELETE FROM `forum_categories` WHERE `id` = 2053932785
---
  def destroy
    @forum_category = ForumCategory.find(params[:id])
    @forum_category.destroy