app/controllers/forum_topic_subscriptions_controller.rb

  def index
    @forum_topic_subscriptions = ForumTopicSubscription.paginate(:page => params[:page], :per_page => FORUM_TOPIC_SUBSCRIPTIONS_PER_PAGE)
---
SELECT * FROM `forum_topic_subscriptions` LIMIT 0, 20

  def find_forum_topic_subscription
    @forum_topic_subscription = ForumTopicSubscription.find(params[:id]) if params[:id]
---
SELECT * FROM `forum_topic_subscriptions` WHERE (`forum_topic_subscriptions`.`id` = 2053932785)