app/controllers/members_controller.rb

SELECT * FROM `members` LIMIT 1
SELECT count(*) AS count_all FROM `members`
---
  def create
    logout_keeping_session!
    @member = Member.new(params[:member])
    @member.register! if @member && @member.valid?
    success = @member && @member.valid?
    if success && @member.errors.empty?

SELECT * FROM `members` WHERE (`members`.`activation_code` = '1b6453892473a467d07372d45eb05abc2031647a') LIMIT 1
---
  def activate
    logout_keeping_session!
    member = Member.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?