app/controllers/memberships_controller.rb

SELECT * FROM `memberships` ORDER BY last_name LIMIT 0, 20
---
  def index
    @memberships = Membership.paginate(:page => params[:page], :per_page => MEMBERSHIPS_PER_PAGE, :order => "last_name")

SELECT * FROM `memberships` WHERE (`memberships`.`id` = 2053932785)
---
  def find_membership
    @membership = Membership.find(params[:id]) if params[:id]