app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all.reverse
---
SELECT * FROM `newsletters`

  def show
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 2053932785)

  def edit
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 2053932785)

  def create
    @newsletter = Newsletter.new(params[:newsletter])

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO `newsletters` (`subject`, `body`, `created_at`, `updated_at`) VALUES('Supergrooven new coop website!', 'All hail Chris! What an awesome web site! We love you! Oh yeah, also we have food and stuff. But you knew that you clever, clever monkeys you! Star monkey\'s even! [Crowd applauds]', '2009-09-19 05:03:23', '2009-09-19 05:03:23')

  def update
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 2053932785)

  def destroy
    @newsletter = Newsletter.find(params[:id])
    @newsletter.destroy
---
SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 2053932785)
DELETE FROM `newsletters` WHERE `id` = 2053932785