app/controllers/product_requests_controller.rb

SELECT * FROM `product_requests` WHERE (`product_requests`.product_request_status_id = 298486374)
SELECT * FROM `product_request_statuses`
---
  def index
    @product_requests = ProductRequest.all
    @product_request_statuses = ProductRequestStatus.all

SELECT * FROM `product_requests` WHERE (`product_requests`.`id` = 2053932785)
---
  def show
    @product_request = ProductRequest.find(params[:id])

SELECT * FROM `product_request_statuses` WHERE (`product_request_statuses`.`name` = 'Unordered') LIMIT 1
---
  def new
    #Don't know of a cleaner way to do this, but need to make sure that the default status is set to unorderd
    status_id = ProductRequestStatus.find_by_name("Unordered" || 1).id

SELECT * FROM `product_requests` WHERE (`product_requests`.`id` = 2053932785)
---
  def edit
    @product_request = ProductRequest.find(params[:id])

INSERT INTO `product_requests` (`description`, `created_at`, `updated_at`, `product_number`, `distributor_id`, `product_request_status_id`) VALUES(NULL, '2009-10-26 20:36:26', '2009-10-26 20:36:26', NULL, NULL, NULL)
---
  def create
    @product_request = ProductRequest.new(params[:product_request]).reverse

    respond_to do |format|
      if @product_request.save

SELECT * FROM `product_requests` WHERE (`product_requests`.`id` = 2053932785)
UPDATE `product_requests` SET `product_request_status_id` = 2, `updated_at` = '2009-10-02 20:25:22' WHERE `id` = 7
---
  def update
    @product_request = ProductRequest.find(params[:id])

    respond_to do |format|
      if @product_request.update_attributes(params[:product_request])

SELECT * FROM `product_requests` WHERE (`product_requests`.`id` = 2053932785)
DELETE FROM `product_requests` WHERE `id` = 2053932785
---
  def destroy
    @product_request = ProductRequest.find(params[:id])
    @product_request.destroy