app/controllers/volunteer_tasks_controller.rb

SELECT * FROM `volunteer_tasks`
---
  def index
    @volunteer_tasks = VolunteerTask.all.sort {|a,b| a.order <=> b.order}

SELECT * FROM `volunteer_tasks` WHERE (`volunteer_tasks`.`id` = 2053932785)
---
  def show
    @volunteer_task = VolunteerTask.find(params[:id])

SELECT * FROM `volunteer_tasks` WHERE (`volunteer_tasks`.`id` = 2053932785)
---
  def edit
    @volunteer_task = VolunteerTask.find(params[:id])

INSERT INTO `volunteer_tasks` (`name`, `description`, `created_at`, `updated_at`, `order`) VALUES(NULL, NULL, '2009-11-13 02:24:09', '2009-11-13 02:24:09', NULL)
---
  def create
    @volunteer_task = VolunteerTask.new(params[:volunteer_task])

    respond_to do |format|
      if @volunteer_task.save

SELECT * FROM `volunteer_tasks` WHERE (`volunteer_tasks`.`id` = 2053932785)
---
  def update
    @volunteer_task = VolunteerTask.find(params[:id])

SELECT * FROM `volunteer_tasks` WHERE (`volunteer_tasks`.`id` = 2053932785)
DELETE FROM `volunteer_tasks` WHERE `id` = 2053932785
---
  def destroy
    @volunteer_task = VolunteerTask.find(params[:id])
    @volunteer_task.destroy