app/controllers/volunteer_offerings_controller.rb

SELECT * FROM `volunteer_offerings`
---
	def index
		@volunteer_offerings = VolunteerOffering.all

SELECT * FROM `volunteer_offerings` WHERE (`volunteer_offerings`.`id` = 2053932785)
---
	def show
		@volunteer_offering = VolunteerOffering.find(params[:id])

SELECT * FROM `volunteer_offerings` WHERE (`volunteer_offerings`.`id` = 2053932785)
---
	def edit
		@volunteer_offering = VolunteerOffering.find(params[:id])

INSERT INTO `volunteer_offerings` (`member_id`, `volunteer_task_id`, `alt_contact`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2009-10-26 20:36:27', '2009-10-26 20:36:27')
---
	def create
		@volunteer_offering = VolunteerOffering.new(params[:volunteer_offering])

		respond_to do |format|
			if @volunteer_offering.save

SELECT * FROM `volunteer_offerings` WHERE (`volunteer_offerings`.`id` = 2053932785)
---
	def update
		@volunteer_offering = VolunteerOffering.find(params[:id])

SELECT * FROM `volunteer_offerings` WHERE (`volunteer_offerings`.`id` = 2053932785)
DELETE FROM `volunteer_offerings` WHERE `id` = 2053932785
---
	def destroy
		@volunteer_offering = VolunteerOffering.find(params[:id])
		@volunteer_offering.destroy