app/controllers/wholesale_orders_controller.rb

SELECT * FROM `wholesale_orders` WHERE (`wholesale_orders`.member_id = 14)
SELECT * FROM `content_items` WHERE (`content_items`.`tag` = 'wholesale_ordering_preamble') LIMIT 1
---
  def index
    if admin?
      @wholesale_orders = WholesaleOrder.all
    elsif current_member
      @wholesale_orders = current_member.wholesale_orders
    else
      @wholesale_orders = []
    end

    @content = Hash.new
    [:wholesale_ordering_preamble,
      :wholesale_ordering_unfi,
      :wholesale_ordering_azures,
      :wholesale_ordering_rest].each do |item|
        @content[item] = ContentItem.find_by_tag(item.to_s)

SELECT * FROM `wholesale_orders` WHERE (`wholesale_orders`.`id` = 2053932785)
---
  def show
    @wholesale_order = WholesaleOrder.find(params[:id])

SELECT * FROM `wholesale_orders` WHERE (`wholesale_orders`.`id` = 2053932785)
---
  def edit
    @wholesale_order = WholesaleOrder.find(params[:id])

INSERT INTO `wholesale_orders` (`product_name`, `product_number`, `quantity`, `ordered`, `arrived`, `created_at`, `updated_at`, `distributor_id`, `member_id`) VALUES('gratiuitous mayo', '#MAY7829', '5 galons!', NULL, NULL, '2009-10-04 07:46:23', '2009-10-04 07:46:23', 1, 14)
---
  def create
    @wholesale_order = WholesaleOrder.new(params[:wholesale_order].merge({:member_id => current_member.id}))

    respond_to do |format|
      if @wholesale_order.save

SELECT * FROM `wholesale_orders` WHERE (`wholesale_orders`.`id` = 2053932785)
UPDATE `wholesale_orders` SET `distributor_id` = 1, `updated_at` = '2009-10-03 05:04:28' WHERE `id` = 1
---
  def update
    @wholesale_order = WholesaleOrder.find(params[:id])

    respond_to do |format|
      if @wholesale_order.update_attributes(params[:wholesale_order])

SELECT * FROM `wholesale_orders` WHERE (`wholesale_orders`.`id` = 2053932785)
DELETE FROM `wholesale_orders` WHERE `id` = 2053932785
---
  def destroy
    @wholesale_order = WholesaleOrder.find(params[:id])
    @wholesale_order.destroy